app/Services/DashboardBlockService.php

SELECT *
FROM `dashboard_block_types`
WHERE `dashboard_block_types`.`id` = 'ffa1dad2-9227-453f-8930-9eef8aaf7fc1'
---
    public function getBlockForEdit(string $blockId): ?array
    {
        $blockId = trim($blockId);
        if ($blockId === '' || ! $this->builderTablesReady()) {
            return null;
        }

        $block = $this->dashboardBlockInstanceModel->findInstanceWithBlock($blockId);
        if (! is_array($block)) {
            return null;
        }

        $block['config'] = $this->decodeConfig($block['config_json'] ?? null);
        $relationColumn = $this->dashboardBlockInstanceModel->relationColumn();
        $blockTypeId = trim((string) ($block[$relationColumn] ?? ''));
        $blockType = $blockTypeId !== '' ? $this->dashboardBlockTypeModel->find($blockTypeId) : null;

UPDATE `dashboard_block_instances` SET `title` = 'Toplam Siparis', `config_json` = '{\"title\":\"Toplam Siparis\",\"subtitle\":\"Tum siparislerin genel ozeti\",\"date_range\":\"30d\",\"data_source\":\"total_orders\",\"value_label\":\"Siparis\",\"value\":\"Sipariş Deneme\",\"variant\":\"mini_spark\",\"comparison_type\":\"previous_period\",\"color_palette\":\"blue\",\"custom_colors\":[\"#06B6D4\"]}', `is_visible` = 1, `updated_at` = '2026-04-04 05:43:07'
WHERE `dashboard_block_instances`.`id` IN ('1543aeec-d547-4ce6-9dac-f84908355134')
---
            'is_visible' => $this->normalizeVisibility($data['is_visible'] ?? ($block['is_visible'] ?? 1)),
        ];

        if (! $this->dashboardBlockInstanceModel->update((string) $block['id'], $payload)) {

SELECT *
FROM `dashboard_blocks`
WHERE `dashboard_blocks`.`id` = '4b824793-a5c8-42ff-bbf3-b5f6ff606e42'
DELETE FROM `dashboard_blocks`
WHERE `id` IN ('4b824793-a5c8-42ff-bbf3-b5f6ff606e42')
---
    public function deleteBlock(string $blockId): array
    {
        $blockId = trim($blockId);
        if ($blockId === '' || ! $this->builderTablesReady()) {
            return [
                'success' => false,
                'errors' => ['Dashboard blogu bulunamadi.'],
            ];
        }

        if (! is_array($this->dashboardBlockInstanceModel->find($blockId))) {
            return [
                'success' => false,
                'errors' => ['Dashboard blogu bulunamadi.'],
            ];
        }

        if (! $this->dashboardBlockInstanceModel->delete($blockId)) {