app/Services/NotificationTemplateService.php

        $payload['id'] = NotificationEmailTemplateModel::uuidV4();
        $payload['created_by'] = $actorId;

        if (! $this->notificationEmailTemplateModel->insert($payload, false)) {
---
INSERT INTO `notification_email_templates` (`template_name`, `template_type`, `subject`, `message`, `is_active`, `updated_by`, `id`, `created_by`, `created_at`, `updated_at`) VALUES ('WELCOME 10 Kupon Tanımlaması', 'custom', 'BeAble Pro test e-postası', 'Merhaba {name},\r\n\r\nBu alan manuel içerik için ayrılmıştır. Buraya kendi test mesajınızı güvenle yazabilir, konu ve metin üzerinde doğrudan düzenleme yapabilirsiniz.\r\n\r\nİletişim e-posta adresi: {email}', 1, '57f01727-71c9-4921-96c0-1a55eeeabed3', '3ff8807b-0b15-48cc-b4e1-1a8956cab3f8', '57f01727-71c9-4921-96c0-1a55eeeabed3', '2026-04-10 11:24:51', '2026-04-10 11:24:51')