app/Services/OrdersReportingService.php

SELECT DATE_FORMAT(DATE(COALESCE(order_date, created_at)), '%Y-%m-%d') AS period_label, COALESCE(SUM(total_amount), 0) AS total_amount
FROM `orders`
WHERE DATE(COALESCE(order_date, created_at)) >= '2026-02-10'
GROUP BY `period_label`
ORDER BY `period_label` ASC
---
            }
        }

        $rows = $db->table('orders')
            ->select($labelExpr . ' AS period_label', false)
            ->select('COALESCE(SUM(total_amount), 0) AS total_amount', false)
            ->where("DATE(COALESCE(order_date, created_at)) >= " . $db->escape($fromDate), null, false)
            ->groupBy('period_label')
            ->orderBy('period_label', 'ASC')
            ->get()
            ->getResultArray();

SELECT COALESCE(NULLIF(order_status, ''), status) AS normalized_status, COUNT(*) AS total_count
FROM `orders`
WHERE DATE(COALESCE(order_date, created_at)) >= '2026-03-05'
GROUP BY `normalized_status`
---
    public function buildStatusDistributionPayload(?string $rangeRaw): array
    {
        $range = strtolower(trim((string) ($rangeRaw ?? 'weekly')));
        if ($range !== 'weekly') {
            $range = 'weekly';
        }

        $statuses = [
            'pending' => 'Beklemede',
            'preparing' => "Haz\u{0131}rlan\u{0131}yor",
            'packed' => 'Paketlendi',
            'shipped' => 'Kargoya Verildi',
            'delivered' => 'Teslim Edildi',
            'cancelled' => "\u{0130}ptal Edildi",
            'return_in_progress' => "\u{0130}ade S\u{00FC}recinde",
            'return_done' => "\u{0130}ade Tamamland\u{0131}",
        ];

        $dateFrom = (new \DateTimeImmutable('today'))->modify('-6 days')->format('Y-m-d');
        $db = db_connect();
        $rows = $db->table('orders')
            ->select("COALESCE(NULLIF(order_status, ''), status) AS normalized_status", false)
            ->select('COUNT(*) AS total_count', false)
            ->where("DATE(COALESCE(order_date, created_at)) >= " . $db->escape($dateFrom), null, false)
            ->groupBy('normalized_status')
            ->get()
            ->getResultArray();