app/Services/PageBuilderService.php

INSERT INTO `page_versions` (`page_id`, `version_no`, `name`, `status`, `created_by`, `notes`, `scheduled_publish_at`, `published_at`, `archived_at`, `created_at`, `updated_at`, `id`) VALUES ('673c0d9b-257c-4fde-8598-09ac7b0eb10e', 2, 'Draft 2', 'DRAFT', '57f01727-71c9-4921-96c0-1a55eeeabed3', 'Yeni draft olusturuldu.', NULL, NULL, NULL, '2026-04-09 14:42:42', '2026-04-09 14:42:42', 'b1d7e8c4-dce0-4e58-9bee-f3772fa86580')
---
    public function createDraft(string $pageId, ?string $sourceVersionId = null): array
    {
        if (! $this->pageVersionService->tablesReady()) {
            return ['success' => false, 'error' => 'Draft tablolari hazir degil.'];
        }

        $versionNo = $this->pageVersionModel->getNextVersionNo($pageId);
        $sourceVersion = $sourceVersionId !== null && $sourceVersionId !== '' ? $this->pageVersionService->findVersionDetail($sourceVersionId) : null;
        $draftName = $sourceVersionId !== null && is_array($sourceVersion)
            ? 'Kopya ' . trim((string) ($sourceVersion['name'] ?? ('Draft ' . ($sourceVersion['version_no'] ?? 1))))
            : 'Draft ' . $versionNo;

        $db = db_connect();
        $db->transStart();

        $newVersionId = $this->pageVersionModel->insert([
            'page_id' => $pageId,
            'version_no' => $versionNo,
            'name' => $draftName,
            'status' => 'DRAFT',
            'created_by' => $this->actorId(),
            'notes' => $sourceVersionId !== null && is_array($sourceVersion)
                ? trim((string) ($sourceVersion['notes'] ?? ''))
                : 'Yeni draft olusturuldu.',
            'scheduled_publish_at' => null,
            'published_at' => null,
            'archived_at' => null,
        ], true);

UPDATE `page_versions` SET `status` = 'SCHEDULED', `scheduled_publish_at` = '2026-04-10 20:45:00', `published_at` = NULL, `archived_at` = NULL, `updated_at` = '2026-04-09 14:43:02'
WHERE `page_versions`.`id` IN ('b1d7e8c4-dce0-4e58-9bee-f3772fa86580')
---
    public function scheduleDraft(string $versionId, string $scheduledAt): array
    {
        if (! $this->pageVersionService->tablesReady()) {
            return ['success' => false, 'error' => 'Draft tablolari hazir degil.'];
        }

        $version = $this->pageVersionService->findVersionDetail($versionId);
        if (! is_array($version)) {
            return ['success' => false, 'error' => 'Planlanacak draft bulunamadi.'];
        }

        $status = (string) ($version['status'] ?? '');
        if ($status === 'PUBLISHED') {
            return ['success' => false, 'error' => 'Canlidaki version yeniden schedule edilemez.'];
        }

        if ($status === 'ARCHIVED') {
            return ['success' => false, 'error' => 'Arsivlenmis version schedule edilemez.'];
        }

        $normalizedDate = $this->normalizeScheduleDate($scheduledAt);
        if (! is_array($normalizedDate) || ! ($normalizedDate['success'] ?? false)) {
            return ['success' => false, 'error' => (string) ($normalizedDate['error'] ?? 'Planlama tarihi gecersiz.')];
        }

        $updated = $this->pageVersionModel->update($versionId, [
            'status' => 'SCHEDULED',
            'scheduled_publish_at' => $normalizedDate['value'],
            'published_at' => null,
            'archived_at' => null,
        ]);