app/Services/StorefrontHomeService.php

SELECT *
FROM `products`
WHERE `category_id` = 'f4df1ed5-3339-4388-9c03-c5f66867ae68'
AND `is_active` = 1
AND `products`.`deleted_at` IS NULL
---
    private function detectCategoryType(string $categoryId): string
    {
        $products = $this->productsModel->where('category_id', $categoryId)
            ->where('is_active', 1)
            ->findAll();