app/Filters/CampaignAccessFilter.php

    private function hasPermissionCode(string $userId, string $role, string $permissionCode): bool
    {
        $db = db_connect();

        $permRow = $db->table('permissions')
            ->select('id')
            ->where('code', $permissionCode)
            ->where('deleted_at', null)
            ->get()
            ->getRowArray();

        if (! is_array($permRow) || ! isset($permRow['id'])) {
            return false;
        }
        $permissionId = (string) $permRow['id'];

        $override = $db->table('user_permissions')
            ->select('allowed')
            ->where('user_id', $userId)
            ->where('permission_id', $permissionId)
            ->where('deleted_at', null)
            ->orderBy('updated_at', 'DESC')
            ->get()
            ->getRowArray();

        if (is_array($override)) {
            return (int) ($override['allowed'] ?? 0) === 1;
        }

        $roleRow = $db->table('roles')
            ->select('id')
            ->where('name', $role)
            ->where('deleted_at', null)
            ->get()
            ->getRowArray();
---
SELECT `id`
FROM `permissions`
WHERE `code` = 'manage_campaigns_engine'
AND `deleted_at` IS NULL
SELECT `allowed`
FROM `user_permissions`
WHERE `user_id` = '2c5df90f-8147-4afb-9e94-1aecdff5ac0a'
AND `permission_id` = '0bdae932-120f-47ff-a73f-3d4a1335f01d'
AND `deleted_at` IS NULL
ORDER BY `updated_at` DESC
SELECT `id`
FROM `roles`
WHERE `name` = 'admin'
AND `deleted_at` IS NULL

            return false;
        }

        $rolePerm = $db->table('role_permissions')
            ->select('id')
            ->where('role_id', (string) $roleRow['id'])
            ->where('permission_id', $permissionId)
            ->where('deleted_at', null)
            ->get()
            ->getRowArray();
---
SELECT `id`
FROM `role_permissions`
WHERE `role_id` = '1789648e-93ad-4bb3-b0ec-116aa503216c'
AND `permission_id` = '0bdae932-120f-47ff-a73f-3d4a1335f01d'
AND `deleted_at` IS NULL