app/Controllers/Home.php

    public function index() {
        $db = \Config\Database::connect();

        // 1. Sadece Basılı Ürünlerin İstatistikleri
        $data['total_basili'] = $db->table('products')
                                ->where('type', 'basili')
                                ->where('deleted_at', null)
                                ->countAllResults();

        // 2. Kritik Stok (Stoku 5'ten az olan basılı kitaplar)
        $data['critical_stock'] = $db->table('products')
                                    ->where('type', 'basili')
                                    ->where('stock_count <', 5)
                                    ->where('deleted_at', null)
                                    ->get()->getResult();

        // 3. Kategori Dağılımı (Pasta Grafik İçin Veri)
        $data['chart_data'] = $db->table('products')
                                ->select('categories.category_name, COUNT(products.id) as count')
                                ->join('categories', 'categories.id = products.category_id')
                                ->where('products.type', 'basili')
                                ->groupBy('products.category_id')
                                ->get()->getResult();
---
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `type` = 'basili'
AND `deleted_at` IS NULL
SELECT *
FROM `products`
WHERE `type` = 'basili'
AND `stock_count` < 5
AND `deleted_at` IS NULL
SELECT `categories`.`category_name`, COUNT(products.id) as count
FROM `products`
JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`type` = 'basili'
GROUP BY `products`.`category_id`