app/Models/AdminSettingModel.php

    public function getByKeyPrefix(string $prefix): array
    {
        return $this->builder()
            ->select('setting_key, setting_value')
            ->like('setting_key', $prefix, 'after')
            ->get()
            ->getResultArray();
---
SELECT `setting_key`, `setting_value`
FROM `admin_settings`
WHERE `setting_key` LIKE 'revenue_table_%' ESCAPE '!'