app/Models/AdminNoteModel.php

    public function getLatest(int $limit = 20): array
    {
        return $this->builder()
            ->select('id, admin_id, note, created_at, updated_at')
            ->orderBy('id', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();
---
SELECT `id`, `admin_id`, `note`, `created_at`, `updated_at`
FROM `admin_notes`
ORDER BY `id` DESC
 LIMIT 20