app/Models/BlockTypeModel.php

SELECT *
FROM `block_types`
WHERE `is_active` = 1
ORDER BY `name` ASC
---
    public function findActiveOrdered(): array
    {
        return $this->where('is_active', 1)
            ->orderBy('name', 'ASC')
            ->findAll();