app/Models/BlockInstanceModel.php

    public function findByPageVersion(string $pageVersionId): array
    {
        return $this->where('owner_type', 'PAGE')
            ->where('owner_version_id', $pageVersionId)
            ->orderBy('order_index', 'ASC')
            ->findAll();
---
SELECT *
FROM `block_instances`
WHERE `owner_type` = 'PAGE'
AND `owner_version_id` = '0d0a3390-f36f-4e30-94a7-5dfcc6b350a2'
ORDER BY `order_index` ASC

    public function findDetailedByPageVersion(string $pageVersionId): array
    {
        return $this->select('block_instances.*, block_types.code AS block_type_code, block_types.name AS block_type_name')
            ->join('block_types', 'block_types.id = block_instances.block_type_id', 'left')
            ->where('block_instances.owner_type', 'PAGE')
            ->where('block_instances.owner_version_id', $pageVersionId)
            ->orderBy('block_instances.order_index', 'ASC')
            ->findAll();
---
SELECT `block_instances`.*, `block_types`.`code` AS `block_type_code`, `block_types`.`name` AS `block_type_name`
FROM `block_instances`
LEFT JOIN `block_types` ON `block_types`.`id` = `block_instances`.`block_type_id`
WHERE `block_instances`.`owner_type` = 'PAGE'
AND `block_instances`.`owner_version_id` = '21193aac-6657-4812-82e3-8e93e2bd724d'
ORDER BY `block_instances`.`order_index` ASC