app/Models/CategoryModel.php

SELECT *
FROM `categories`
ORDER BY `category_name` ASC
---
    public function getAllForAdmin(): array
    {
        return $this->orderBy('category_name', 'ASC')->findAll();

SELECT `id`, `category_name`
FROM `categories`
WHERE LOWER(category_name) = 'roman'
 LIMIT 1
---
    public function findByName(string $name): ?array
    {
        $normalized = trim($name);
        if ($normalized === '') {
            return null;
        }

        $normalizedLower = function_exists('mb_strtolower')
            ? mb_strtolower($normalized, 'UTF-8')
            : strtolower($normalized);

        return $this->builder()
            ->select('id, category_name')
            ->where('LOWER(category_name)', $normalizedLower)
            ->limit(1)
            ->get()
            ->getRowArray() ?: null;