app/Models/DashboardModel.php

    public function findActiveForUser(?string $userId): ?array
    {
        $userId = trim((string) $userId);

        if ($userId !== '') {
            $row = $this->where('is_active', 1)
                ->where('user_id', $userId)
                ->orderBy('updated_at', 'DESC')
                ->first();
---
SELECT *
FROM `dashboards`
WHERE `is_active` = 1
AND `user_id` = '57f01727-71c9-4921-96c0-1a55eeeabed3'
AND `dashboards`.`deleted_at` IS NULL
ORDER BY `updated_at` DESC
 LIMIT 1