app/Models/DashboardBlockInstanceModel.php

SELECT `dashboard_block_instances`.*, `dashboard_block_types`.`code` AS `block_type_code`, `dashboard_block_types`.`name` AS `block_type_name`
FROM `dashboard_block_instances`
LEFT JOIN `dashboard_block_types` ON `dashboard_block_types`.`id` = `dashboard_block_instances`.`block_type_id`
WHERE `dashboard_block_instances`.`dashboard_id` = '9115ae00-a259-4440-a1b6-001b4477e738'
ORDER BY `dashboard_block_instances`.`order_index` ASC, `dashboard_block_instances`.`position_y` ASC, `dashboard_block_instances`.`position_x` ASC
---
    public function getInstancesByDashboardId(string $dashboardId): array
    {
        $relationColumn = $this->relationColumn();
        $typeTable = $this->blockTypeTable();

        return $this->select('dashboard_block_instances.*, ' . $typeTable . '.code AS block_type_code, ' . $typeTable . '.name AS block_type_name')
            ->join($typeTable, $typeTable . '.id = dashboard_block_instances.' . $relationColumn, 'left')
            ->where('dashboard_block_instances.dashboard_id', $dashboardId)
            ->orderBy('dashboard_block_instances.order_index', 'ASC')
            ->orderBy('dashboard_block_instances.position_y', 'ASC')
            ->orderBy('dashboard_block_instances.position_x', 'ASC')
            ->findAll();