app/Models/DashboardBlockTypeModel.php

SELECT *
FROM `dashboard_block_types`
WHERE `is_active` = 1
ORDER BY `name` ASC
---
    public function getActiveTypes(): array
    {
        return $this->where('is_active', 1)
            ->orderBy('name', 'ASC')
            ->findAll();