app/Models/OrderModel.php

    public function getTopCategoriesByQuantity(int $limit = 6): array
    {
        return $this->db->table('orders o')
            ->select('c.category_name as category_name, SUM(o.quantity) as qty')
            ->join('products p', 'p.id = o.product_id', 'left')
            ->join('categories c', 'c.id = p.category_id', 'left')
            ->groupBy('c.category_name')
            ->orderBy('qty', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();
---
SELECT `c`.`category_name` as `category_name`, SUM(o.quantity) as qty
FROM `orders` `o`
LEFT JOIN `products` `p` ON `p`.`id` = `o`.`product_id`
LEFT JOIN `categories` `c` ON `c`.`id` = `p`.`category_id`
GROUP BY `c`.`category_name`
ORDER BY `qty` DESC
 LIMIT 6