app/Models/OrderModel.php

SELECT COUNT(*) AS `numrows`
FROM `orders`
---
    public function countAllOrders(): int
    {
        return (int) $this->builder()->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `order_date` >= '2026-04-25 00:00:00'
AND `order_date` <= '2026-04-25 23:59:59'
---
    public function countOrdersBetween(string $start, string $end): int
    {
        return (int) $this->builder()
            ->where('order_date >=', $start)
            ->where('order_date <=', $end)
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE   (
`status` = 'pending'
OR `order_status` = 'pending'
 )
---
    public function countOrdersByStatus(string $status): int
    {
        return (int) $this->builder()
            ->groupStart()
            ->where('status', $status)
            ->orWhere('order_status', $status)
            ->groupEnd()
            ->countAllResults();

SELECT `o`.`id`, `o`.`order_no`, `o`.`customer_name`, `o`.`total_amount`, `o`.`status`, `o`.`order_status`, `o`.`order_date`, `o`.`created_at`, `p`.`product_name`
FROM `orders` `o`
LEFT JOIN `products` `p` ON `p`.`id` = `o`.`product_id`
ORDER BY `o`.`created_at` DESC
 LIMIT 5
---
    public function getLatestWithProductName(int $limit = 5): array
    {
        return $this->db->table('orders o')
            ->select('o.id, o.order_no, o.customer_name, o.total_amount, o.status, o.order_status, o.order_date, o.created_at, p.product_name')
            ->join('products p', 'p.id = o.product_id', 'left')
            ->orderBy('o.created_at', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();

SELECT DATE(order_date) as d, COUNT(*) as c
FROM `orders`
WHERE `order_date` >= '2026-04-12 00:00:00'
AND `order_date` <= '2026-04-25 23:59:59'
GROUP BY DATE(order_date)
ORDER BY `d` ASC
---
    public function getDailyCounts(string $start, string $end): array
    {
        return $this->builder()
            ->select('DATE(order_date) as d, COUNT(*) as c')
            ->where('order_date >=', $start)
            ->where('order_date <=', $end)
            ->groupBy('DATE(order_date)')
            ->orderBy('d', 'ASC')
            ->get()
            ->getResultArray();

SELECT MAX(order_date) as latest_order_date
FROM `orders`
---
    public function getLatestOrderDate(): ?string
    {
        $row = $this->builder()
            ->select('MAX(order_date) as latest_order_date')
            ->get()
            ->getRowArray();

SELECT COALESCE(SUM(total_amount), 0) as total
FROM `orders`
WHERE `order_date` >= '2026-04-25 00:00:00'
AND `order_date` <= '2026-04-25 23:59:59'
AND `status` != 'cancelled'
---
    public function getRevenueSumRow(string $start, string $end): array
    {
        return $this->builder()
            ->select('COALESCE(SUM(total_amount),0) as total')
            ->where('order_date >=', $start)
            ->where('order_date <=', $end)
            ->where('status !=', 'cancelled')
            ->get()
            ->getRowArray() ?? [];

SELECT `c`.`category_name` as `category_name`, SUM(o.quantity) as qty
FROM `orders` `o`
INNER JOIN `products` `p` ON `p`.`id` = `o`.`product_id`
INNER JOIN `categories` `c` ON `c`.`id` = `p`.`category_id`
WHERE `c`.`category_name` != ''
GROUP BY `c`.`id`, `c`.`category_name`
ORDER BY `qty` DESC
 LIMIT 6
---
    public function getTopCategoriesByQuantity(int $limit = 6): array
    {
        return $this->db->table('orders o')
            ->select('c.category_name as category_name, SUM(o.quantity) as qty')
            ->join('products p', 'p.id = o.product_id', 'inner')
            ->join('categories c', 'c.id = p.category_id', 'inner')
            ->where('c.category_name !=', '')
            ->groupBy('c.id, c.category_name')
            ->orderBy('qty', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();

SELECT `a`.`name` as `author_name`, SUM(o.quantity) as qty
FROM `orders` `o`
LEFT JOIN `products` `p` ON `p`.`id` = `o`.`product_id`
LEFT JOIN `authors` `a` ON `a`.`id` = `p`.`author_id`
GROUP BY `a`.`name`
ORDER BY `qty` DESC
 LIMIT 10
---
    public function getTopAuthorsByQuantity(int $limit = 10): array
    {
        return $this->db->table('orders o')
            ->select('a.name as author_name, SUM(o.quantity) as qty')
            ->join('products p', 'p.id = o.product_id', 'left')
            ->join('authors a', 'a.id = p.author_id', 'left')
            ->groupBy('a.name')
            ->orderBy('qty', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();

SELECT `p`.`product_name` as `title`, SUM(o.quantity) as qty
FROM `orders` `o`
LEFT JOIN `products` `p` ON `p`.`id` = `o`.`product_id`
WHERE `p`.`type` = 'digital'
GROUP BY `p`.`product_name`
ORDER BY `qty` DESC
 LIMIT 10
---
    public function getTopDigitalBooksByQuantity(int $limit = 10): array
    {
        return $this->db->table('orders o')
            ->select('p.product_name as title, SUM(o.quantity) as qty')
            ->join('products p', 'p.id = o.product_id', 'left')
            ->where('p.type', 'digital')
            ->groupBy('p.product_name')
            ->orderBy('qty', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `orders` `o`
LEFT JOIN `users` `u` ON `u`.`id` = `o`.`user_id`
WHERE `o`.`deleted_at` IS NULL
AND   (
`o`.`order_no` LIKE '%al%' ESCAPE '!'
OR  `o`.`id` LIKE '%al%' ESCAPE '!'
OR  `o`.`customer_name` LIKE '%al%' ESCAPE '!'
OR  `o`.`tracking_number` LIKE '%al%' ESCAPE '!'
OR  `u`.`username` LIKE '%al%' ESCAPE '!'
OR  `u`.`email` LIKE '%al%' ESCAPE '!'
 )
---
    public function datatablesList(array $params): array
    {
        $baseBuilder = $this->db->table('orders o')
            ->select("
                o.id,
                o.order_no,
                o.customer_name,
                o.total_amount,
                o.created_at,
                o.order_date,
                o.payment_method,
                o.payment_status,
                o.order_status,
                o.shipping_status,
                o.shipping_company,
                o.tracking_number,
                o.status,
                COALESCE(NULLIF(o.customer_name, ''), u.username, u.email, '-') AS customer_display
            ")
            ->join('users u', 'u.id = o.user_id', 'left')
            ->where('o.deleted_at', null);

SELECT `o`.*, `p`.`product_name`, `p`.`price` AS `product_price`, `u`.`username` AS `user_name`, `u`.`email` AS `user_email`
FROM `orders` `o`
LEFT JOIN `products` `p` ON `p`.`id` = `o`.`product_id`
LEFT JOIN `users` `u` ON `u`.`id` = `o`.`user_id`
WHERE `o`.`deleted_at` IS NULL
AND   (
`o`.`id` = '435281e9-dbd8-44a7-b34a-ff5abcba5e5b'
OR `o`.`order_no` = '435281e9-dbd8-44a7-b34a-ff5abcba5e5b'
 )
 LIMIT 1
---
    public function findByIdOrOrderNo(string $identifier): ?array
    {
        $id = trim($identifier);
        if ($id === '') {
            return null;
        }

        return $this->db->table('orders o')
            ->select("
                o.*,
                p.product_name,
                p.price AS product_price,
                u.username AS user_name,
                u.email AS user_email
            ")
            ->join('products p', 'p.id = o.product_id', 'left')
            ->join('users u', 'u.id = o.user_id', 'left')
            ->where('o.deleted_at', null)
            ->groupStart()
            ->where('o.id', $id)
            ->orWhere('o.order_no', $id)
            ->groupEnd()
            ->limit(1)
            ->get()
            ->getRowArray() ?: null;