app/Models/OrderModel.php

    public function getTopAuthorsByQuantity(int $limit = 10): array
    {
        return $this->db->table('orders o')
            ->select('a.name as author_name, SUM(o.quantity) as qty')
            ->join('products p', 'p.id = o.product_id', 'left')
            ->join('authors a', 'a.id = p.author_id', 'left')
            ->groupBy('a.name')
            ->orderBy('qty', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();
---
SELECT `a`.`name` as `author_name`, SUM(o.quantity) as qty
FROM `orders` `o`
LEFT JOIN `products` `p` ON `p`.`id` = `o`.`product_id`
LEFT JOIN `authors` `a` ON `a`.`id` = `p`.`author_id`
GROUP BY `a`.`name`
ORDER BY `qty` DESC
 LIMIT 10

    public function getTopDigitalBooksByQuantity(int $limit = 10): array
    {
        return $this->db->table('orders o')
            ->select('p.product_name as title, SUM(o.quantity) as qty')
            ->join('products p', 'p.id = o.product_id', 'left')
            ->where('p.type', 'digital')
            ->groupBy('p.product_name')
            ->orderBy('qty', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();
---
SELECT `p`.`product_name` as `title`, SUM(o.quantity) as qty
FROM `orders` `o`
LEFT JOIN `products` `p` ON `p`.`id` = `o`.`product_id`
WHERE `p`.`type` = 'digital'
GROUP BY `p`.`product_name`
ORDER BY `qty` DESC
 LIMIT 10

    public function getSalesByProductType(): array
    {
        $productTypeExpr = "CASE
            WHEN LOWER(TRIM(COALESCE(p.type, ''))) IN ('digital', 'dijital', 'ebook', 'e-book') THEN 'digital'
            ELSE 'print'
        END";

        return $this->db->table('orders o')
            ->select($productTypeExpr . ' as product_type, SUM(o.quantity) as qty', false)
            ->join('products p', 'p.id = o.product_id', 'left')
            ->groupBy($productTypeExpr, false)
            ->orderBy('qty', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT CASE
            WHEN LOWER(TRIM(COALESCE(p.type, ''))) IN ('digital', 'dijital', 'ebook', 'e-book') THEN 'digital'
            ELSE 'print'
        END as product_type, SUM(o.quantity) as qty
FROM `orders` `o`
LEFT JOIN `products` `p` ON `p`.`id` = `o`.`product_id`
GROUP BY CASE
            WHEN LOWER(TRIM(COALESCE(p.type, ''))) IN ('digital', 'dijital', 'ebook', 'e-book') THEN 'digital'
            ELSE 'print'
        END
ORDER BY `qty` DESC

    public function getBuilderCategoryDetailAggregate(string $categoryName, ?string $start = null, ?string $end = null): array
    {
        $builder = $this->db->table('orders o')
            ->select("
                p.id as product_id,
                p.product_name,
                p.type as product_type,
                SUM(o.quantity) as sold_qty,
                GREATEST(COALESCE(p.stock_count, 0) - COALESCE(p.reserved_count, 0), 0) as remaining_stock,
                MAX(o.order_date) as last_sale_date
            ")
            ->join('products p', 'p.id = o.product_id', 'inner')
            ->join('categories c', 'c.id = p.category_id', 'inner')
            ->where('o.deleted_at', null)
            ->where('p.deleted_at', null)
            ->where('c.category_name', $categoryName);

        if ($start !== null && $end !== null) {
            $builder->where('o.order_date >=', $start)
                ->where('o.order_date <=', $end);
        }

        return $builder
            ->groupBy('p.id, p.product_name, p.type, p.stock_count, p.reserved_count')
            ->orderBy('sold_qty', 'DESC')
            ->orderBy('p.product_name', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `p`.`id` as `product_id`, `p`.`product_name`, `p`.`type` as `product_type`, SUM(o.quantity) as sold_qty, GREATEST(COALESCE(p.stock_count, 0) - COALESCE(p.reserved_count, 0), 0) as remaining_stock, MAX(o.order_date) as last_sale_date
FROM `orders` `o`
INNER JOIN `products` `p` ON `p`.`id` = `o`.`product_id`
INNER JOIN `categories` `c` ON `c`.`id` = `p`.`category_id`
WHERE `o`.`deleted_at` IS NULL
AND `p`.`deleted_at` IS NULL
AND `c`.`category_name` = 'Şiir'
GROUP BY `p`.`id`, `p`.`product_name`, `p`.`type`, `p`.`stock_count`, `p`.`reserved_count`
ORDER BY `sold_qty` DESC, `p`.`product_name` ASC