app/Models/PageVersionModel.php

    public function findEditableVersionsByPageId(string $pageId): array
    {
        return $this->where('page_id', $pageId)
            ->whereIn('status', ['DRAFT', 'SCHEDULED'])
            ->orderBy('updated_at', 'DESC')
            ->orderBy('version_no', 'DESC')
            ->findAll();
---
SELECT *
FROM `page_versions`
WHERE `page_id` = '673c0d9b-257c-4fde-8598-09ac7b0eb10e'
AND `status` IN ('DRAFT','SCHEDULED')
ORDER BY `updated_at` DESC, `version_no` DESC

    public function findWorkingVersionsByPageId(string $pageId): array
    {
        return $this->where('page_id', $pageId)
            ->whereIn('status', ['DRAFT', 'SCHEDULED', 'PUBLISHED'])
            ->orderBy('version_no', 'DESC')
            ->orderBy('updated_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `page_versions`
WHERE `page_id` = '0638f7f8-1897-4145-8695-1a5282eba0ab'
AND `status` IN ('DRAFT','SCHEDULED','PUBLISHED')
ORDER BY `version_no` DESC, `updated_at` DESC

    public function findPublishedByPageId(string $pageId): ?array
    {
        $row = $this->where('page_id', $pageId)
            ->where('status', 'PUBLISHED')
            ->orderBy('published_at', 'DESC')
            ->first();
---
SELECT *
FROM `page_versions`
WHERE `page_id` = '673c0d9b-257c-4fde-8598-09ac7b0eb10e'
AND `status` = 'PUBLISHED'
ORDER BY `published_at` DESC
 LIMIT 1

    public function findLatestEditableByPageId(string $pageId): ?array
    {
        $row = $this->where('page_id', $pageId)
            ->whereIn('status', ['DRAFT', 'SCHEDULED'])
            ->orderBy('version_no', 'DESC')
            ->orderBy('updated_at', 'DESC')
            ->first();
---
SELECT *
FROM `page_versions`
WHERE `page_id` = '0638f7f8-1897-4145-8695-1a5282eba0ab'
AND `status` IN ('DRAFT','SCHEDULED')
ORDER BY `version_no` DESC, `updated_at` DESC
 LIMIT 1

    public function getNextVersionNo(string $pageId): int
    {
        $row = $this->selectMax('version_no')
            ->where('page_id', $pageId)
            ->first();
---
SELECT MAX(`version_no`) AS `version_no`
FROM `page_versions`
WHERE `page_id` = '673c0d9b-257c-4fde-8598-09ac7b0eb10e'
 LIMIT 1