app/Models/PageModel.php

SELECT *
FROM `pages`
WHERE `code` = 'home'
 LIMIT 1
---
    public function findByCode(string $code): ?array
    {
        $row = $this->where('code', $code)->first();

SELECT *
FROM `pages`
ORDER BY `name` ASC
---
    public function findAllOrdered(): array
    {
        return $this->orderBy('name', 'ASC')->findAll();