app/Models/ProductsModel.php

SELECT *
FROM `products`
WHERE `is_active` = 1
AND `products`.`deleted_at` IS NULL
---
    public function getActiveProducts(): array
    {
        return $this->where('is_active', 1)->findAll();

SELECT `products`.`id`, `products`.`product_name`, `categories`.`category_name`, `products`.`stock_count`, `products`.`reserved_count`, GREATEST(products.stock_count - products.reserved_count, 0) AS available_stock
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`type` = 'basili'
AND `products`.`is_active` = 1
AND `products`.`deleted_at` IS NULL
AND GREATEST(products.stock_count - products.reserved_count, 0) <= 5
AND `products`.`deleted_at` IS NULL
ORDER BY `available_stock` ASC, `products`.`product_name` ASC
---
    public function getCriticalStockPrintedByAvailable(int $threshold = 5): array
    {
        $threshold = max(0, $threshold);

        return $this->select('products.id, products.product_name, categories.category_name, products.stock_count, products.reserved_count, GREATEST(products.stock_count - products.reserved_count, 0) AS available_stock')
            ->join('categories', 'categories.id = products.category_id', 'left')
            ->where('products.type', 'basili')
            ->where('products.is_active', 1)
            ->where('products.deleted_at', null)
            ->where('GREATEST(products.stock_count - products.reserved_count, 0) <=', $threshold)
            ->orderBy('available_stock', 'ASC')
            ->orderBy('products.product_name', 'ASC')
            ->findAll();

SELECT `categories`.`category_name`, COUNT(products.id) as count
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`type` = 'basili'
AND `products`.`is_active` = 1
AND `products`.`deleted_at` IS NULL
AND `products`.`deleted_at` IS NULL
GROUP BY `categories`.`id`, `categories`.`category_name`
ORDER BY `count` DESC, `categories`.`category_name` ASC
---
    public function getCategoryCountsPrinted(): array
    {
        return $this->select('categories.category_name, COUNT(products.id) as count')
            ->join('categories', 'categories.id = products.category_id', 'left')
            ->where('products.type', 'basili')
            ->where('products.is_active', 1)
            ->where('products.deleted_at', null)
            ->groupBy('categories.id, categories.category_name')
            ->orderBy('count', 'DESC')
            ->orderBy('categories.category_name', 'ASC')
            ->findAll();

SELECT `products`.`id`, `products`.`product_name`
FROM `products`
WHERE `products`.`type` = 'basili'
AND `products`.`is_active` = 1
AND `products`.`deleted_at` IS NULL
AND `products`.`deleted_at` IS NULL
ORDER BY `products`.`product_name` ASC
---
    public function getAllActivePrintedProductsForSelect(): array
    {
        return $this->select('products.id, products.product_name')
            ->where('products.type', 'basili')
            ->where('products.is_active', 1)
            ->where('products.deleted_at', null)
            ->orderBy('products.product_name', 'ASC')
            ->findAll();

SELECT `products`.`id`, `products`.`product_name`, `categories`.`category_name`, `products`.`stock_count`, `products`.`reserved_count`, GREATEST(products.stock_count - products.reserved_count, 0) AS salable
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`type` = 'basili'
AND `products`.`is_active` = 1
AND `products`.`deleted_at` IS NULL
AND `products`.`deleted_at` IS NULL
ORDER BY `products`.`product_name` ASC
---
    public function getAllActivePrintedWithStatusForList(): array
    {
        return $this->select('products.id, products.product_name, categories.category_name, products.stock_count, products.reserved_count, GREATEST(products.stock_count - products.reserved_count, 0) AS salable')
            ->join('categories', 'categories.id = products.category_id', 'left')
            ->where('products.type', 'basili')
            ->where('products.is_active', 1)
            ->where('products.deleted_at', null)
            ->orderBy('products.product_name', 'ASC')
            ->findAll();

SELECT `products`.`id`, `products`.`product_name`, `products`.`stock_count`, `products`.`reserved_count`, GREATEST(products.stock_count - products.reserved_count, 0) AS sellable, `categories`.`category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`id` = 'd64e87fa-4655-48db-8098-ea537478fd3d'
AND `products`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getProductStockSnapshot(string $productId): array
    {
        return $this->db->table('products')
            ->select('products.id, products.product_name, products.stock_count, products.reserved_count, GREATEST(products.stock_count - products.reserved_count, 0) AS sellable, categories.category_name')
            ->join('categories', 'categories.id = products.category_id', 'left')
            ->where('products.id', $productId)
            ->where('products.deleted_at', null)
            ->limit(1)
            ->get()
            ->getRowArray() ?? [];

SELECT `l`.`created_at`, `l`.`delta`, `l`.`reason`, `l`.`note`, `l`.`related_order_id`, `l`.`ref_no`, `l`.`actor_user_id`, `u`.`username` AS `actor_name`, `u`.`email` AS `actor_email`
FROM `product_stock_logs` `l`
LEFT JOIN `users` `u` ON `u`.`id` = `l`.`actor_user_id`
WHERE `l`.`product_id` = 'd64e87fa-4655-48db-8098-ea537478fd3d'
ORDER BY `l`.`created_at` DESC
 LIMIT 20
---
    public function getLatestStockMoves(string $productId, int $limit = 20): array
    {
        $limit = max(1, $limit);

        return $this->db->table('product_stock_logs l')
            ->select('l.created_at, l.delta, l.reason, l.note, l.related_order_id, l.ref_no, l.actor_user_id, u.username AS actor_name, u.email AS actor_email')
            ->join('users u', 'u.id = l.actor_user_id', 'left')
            ->where('l.product_id', $productId)
            ->orderBy('l.created_at', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();

UPDATE `products` SET `stock_count` = 4, `updated_at` = '2026-02-25 18:45:42'
WHERE `products`.`id` IN ('d64e87fa-4655-48db-8098-ea537478fd3d')
---

        $this->db->transStart();

        $updated = $this->update($productId, [
            'stock_count' => $newStock,
            'updated_at' => date('Y-m-d H:i:s'),
        ]);

INSERT INTO `product_stock_logs` (`id`, `product_id`, `old_stock`, `new_stock`, `change_amount`, `delta`, `reason`, `note`, `actor_user_id`, `related_order_id`, `ref_no`, `created_at`) VALUES ('f46a09ce-b85b-40d3-af13-2e3e906e0839', 'd64e87fa-4655-48db-8098-ea537478fd3d', 3, 4, 1, 1, 'depo_girisi', 'Yeni ürün geldi', '2c5df90f-8147-4afb-9e94-1aecdff5ac0a', NULL, NULL, '2026-02-25 18:45:42')
---
            return false;
        }

        $inserted = (bool) $this->db->table('product_stock_logs')->insert([
            'id' => BaseUuidModel::uuidV4(),
            'product_id' => $productId,
            'old_stock' => $oldStock,
            'new_stock' => $newStock,
            'change_amount' => $delta,
            'delta' => $delta,
            'reason' => $reason,
            'note' => $note,
            'actor_user_id' => $actorUserId,
            'related_order_id' => $relatedOrderId !== '' ? $relatedOrderId : null,
            'ref_no' => $refNo !== '' ? $refNo : null,
            'created_at' => date('Y-m-d H:i:s'),
        ]);

SELECT DATE(created_at) as d, `new_stock`, `created_at`
FROM `product_stock_logs`
WHERE `product_id` = 'd64e87fa-4655-48db-8098-ea537478fd3d'
AND `created_at` >= '2026-01-27 00:00:00'
AND `created_at` <= '2026-02-25 23:59:59'
ORDER BY `created_at` ASC
---
    public function getStockHistoryDaily(string $productId, int $days = 30): array
    {
        $days = max(1, $days);
        $start = date('Y-m-d 00:00:00', strtotime('-' . ($days - 1) . ' days'));
        $end = date('Y-m-d 23:59:59');

        $rows = $this->db->table('product_stock_logs')
            ->select('DATE(created_at) as d, new_stock, created_at')
            ->where('product_id', $productId)
            ->where('created_at >=', $start)
            ->where('created_at <=', $end)
            ->orderBy('created_at', 'ASC')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
LEFT JOIN `authors` ON `authors`.`id` = `products`.`author_id`
WHERE `products`.`deleted_at` IS NULL
---
    public function datatablesList(array $params): array
    {
        $baseBuilder = $this->db->table('products')
            ->select('products.id, products.product_name AS title, products.type, products.price, products.stock_count AS stock_total, products.reserved_count AS stock_reserved, GREATEST(products.stock_count - products.reserved_count, 0) AS stock_available, products.is_active, categories.category_name, authors.name AS author_name')
            ->join('categories', 'categories.id = products.category_id', 'left')
            ->join('authors', 'authors.id = products.author_id', 'left')
            ->where('products.deleted_at', null);

        $recordsTotal = (clone $baseBuilder)->countAllResults();

        $filteredBuilder = clone $baseBuilder;
        $this->applyDatatablesFilters($filteredBuilder, $params);
        $recordsFiltered = (clone $filteredBuilder)->countAllResults();