app/Models/ShippingModel.php

    public function datatablesList(array $params): array
    {
        $baseBuilder = $this->db->table('orders o')
            ->select($this->selectField('id', 'id'), false)
            ->select($this->selectField('order_no', 'order_no', 'o.id'), false)
            ->select($this->selectField('customer_name', 'customer_name', "'-'"), false)
            ->select($this->selectField('shipping_company', 'shipping_company', "'-'"), false)
            ->select($this->trackingExpression() . ' AS tracking_no', false)
            ->select($this->statusExpression() . ' AS shipping_status', false)
            ->select($this->updatedAtExpression() . ' AS updated_at', false)
            ->select($this->dateOnlyExpression('shipped_at') . ' AS shipped_date', false)
            ->select($this->dateOnlyExpression('delivered_at') . ' AS delivered_date', false);

        if ($this->hasField('deleted_at')) {
            $baseBuilder->where('o.deleted_at', null);
        }

        $recordsTotal = (clone $baseBuilder)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `orders` `o`
WHERE `o`.`deleted_at` IS NULL

    private function hasField(string $fieldName): bool
    {
        return isset($this->orderFields[strtolower($fieldName)]);
---
SELECT COALESCE(NULLIF(o.shipping_status, ''), 'not_shipped') AS shipping_status, o.shipped_at AS shipped_at, o.delivered_at AS delivered_at
FROM `orders` `o`
WHERE `o`.`deleted_at` IS NULL

    public function kpiStats(): array
    {
        $today = date('Y-m-d');
        $builder = $this->db->table('orders o')
            ->select($this->statusExpression() . ' AS shipping_status', false)
            ->select($this->selectField('shipped_at', 'shipped_at', 'NULL') . ', ' . $this->selectField('delivered_at', 'delivered_at', 'NULL'), false);

        if ($this->hasField('deleted_at')) {
            $builder->where('o.deleted_at', null);
        }

        $rows = $builder->get()->getResultArray();
---
SELECT COALESCE(NULLIF(o.shipping_status, ''), 'not_shipped') AS shipping_status, o.shipped_at AS shipped_at, o.delivered_at AS delivered_at
FROM `orders` `o`
WHERE `o`.`deleted_at` IS NULL