app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'admin@site.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function findByEmail(string $email): ?array
    {
        return $this->where('email', $email)->first();

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `created_at` >= '2026-04-25 00:00:00'
AND `created_at` <= '2026-04-25 23:59:59'
---
    public function countCreatedBetween(string $start, string $end): int
    {
        return (int) $this->builder()
            ->where('created_at >=', $start)
            ->where('created_at <=', $end)
            ->countAllResults();