app/Models/VisitModel.php

    public function countBetween(string $start, string $end): int
    {
        return (int) $this->builder()
            ->where('visited_at >=', $start)
            ->where('visited_at <=', $end)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `visits`
WHERE `visited_at` >= '2026-04-25 00:00:00'
AND `visited_at` <= '2026-04-25 23:59:59'

    public function getDailyCounts(string $start, string $end): array
    {
        return $this->builder()
            ->select('DATE(visited_at) as d, COUNT(*) as c')
            ->where('visited_at >=', $start)
            ->where('visited_at <=', $end)
            ->groupBy('DATE(visited_at)')
            ->orderBy('d', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT DATE(visited_at) as d, COUNT(*) as c
FROM `visits`
WHERE `visited_at` >= '2026-04-12 00:00:00'
AND `visited_at` <= '2026-04-25 23:59:59'
GROUP BY DATE(visited_at)
ORDER BY `d` ASC